<template>
  <div class="rules-contianer">
    <mt-header class="header" title="竞拍技术服务协议">
      <header-item slot="left" v-bind:isBack="true" v-on:onclick="goBack"> </header-item>
    </mt-header>
    <div class="rules-content">
      <h2>换换商城竞拍技术服务协议</h2>
      <p class="prog">
        欢迎阅读换换商城《竞拍技术服务协议》 (以下简称“本协议”)。本协议由换换商城所有者及运营者
        换东换西（北京）信息技术有限公司 (以下简称为“换换商城”)与参与竞拍的换换商城用户(以下简称买家“或您“)签署。
      </p>
      <p class="prog">
        在接受本协议之前,请您仔细阅读本协议的全部内容。如果您对本协议的条款有疑问的,请通过换换商城客服渠道进行询问,换换商城客服人员将向您解释条款内容。如果您不同意本协议的任意内容,或者无法准确理解换换商城对条款的解释,请不要进行后续操作。无论您事实上是否认真阅读,当您通过在相关页面勾选同意或点击确认本协议,或实际参与了换换商城竞拍,即视为您接受了本协议及换换商城竞拍规则,并愿意受其拘束。如果发生纠纷,您不能以未仔细阅读为由进行抗辩。
      </p>
      <p class="prog">
        本协议作为您参与换换商城竞拍的约定,可适用于您在换换商城竞拍服务项下的连续的或间断的多次使用行为；如有违反而导致任何法律后果的发生,您将以自己的名义独立承担全部相应的法律责任。
      </p>
      <p class="prog">
        本协议内容包括协议正文、换换商城竞拍规则以及所有换换商城已经发布的或将来可能发布的各类规则、操作流程。所有规则为本协议不可分割的一部分,与协议正文具有同等的法律效力。换换商城有权根据国家法律法规的更新、产品和服务规则的调整需要不时地制订、修改本协议及/或相关规则,并以网站公示的方式进行公示。如您继续参与竞拍的,即表示您接受经修订的协议和规则并同意遵守。如发生有关争议时,以最新的服务协议条款为准。
      </p>
      <div>
        <div class="rules-list" v-for="(rule, index) in rules" :key="`rules${index}`">
          <div class="title">{{ rule.title }}</div>
          <ul>
            <li v-for="(list, i) in rule.list" :key="`rule${i}`">
              <template v-if="typeof list == 'string'">{{ list }}</template>
              <template v-else>
                <ul v-for="(ulList, ulI) in list" :key="`ulrule${ulI}`">
                  {{
                    ulList
                  }}
                </ul>
              </template>
            </li>
          </ul>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
const rules = [
  {
    title: '一、立约背景',
    list: [
      '1、为维护换换商城平台的竞拍交易秩序,规范买家与卖家的竞拍行为,保障竞拍买家与卖家的合法权益,依据换换商城《竞拍规则》和现有竞拍业务的规定拟定本协议。',
      '2、换换商城仅向您提供竞拍技术平台,您可以享受本协议项下的互联网信息服务，网站空间以及网站相关技术支持和服务。',
      '3、换换商城竞拍板块的商品信息及商品相关描述(以下统称“商品信息”)由换换商城的商家提供具体信息，换换商城审核发布，换换商城仅承担《中华人民共和国电商法》规定的电商经营者义务和责任。',
      '4、当您通过使用换换商城竞拍板块查询、浏览竞拍商品信息并按照竞拍规则参与竞拍，并且竞拍成功后,您将受到您与换换商城或您与卖家之间达成的买卖合同的约束。有关竞拍商品的物流、售后、发票等相关问题适用一般买卖法律关系调整，不适用拍卖法律关系调整。'
    ]
  },
  {
    title: '二、定义',
    list: [
      '1、竞拍:是指卖家(换换商城的商家)以竞拍方式发布商品,采用限时网络线上公开竞价形式,由出价最高者最终获得商品的交易方式。',
      '2、竞拍成功者:指竞拍中获胜,最终有权购得商品的买家。'
    ]
  },
  {
    title: '三、参与竞拍的条件',
    list: [
      '1、符合以下条件的买家方能参与竞拍：',
      [
        '（1）其已确认接受《换换商城竞拍技术服务协议》,成为换换商城平台用户并进行用户个人信息认证的；',
        '（2）买家需要报名（支付保证金）且换换商城未拒绝其参与竞拍的申请。在竞买未开始/进行中，买家均可以报名参加竞拍；',
        '（3）买家支付的保证金只能用现金支付。因买家保证金支付存在问题的，换换商城有权拒绝用户参加竞拍的申请；'
      ],
      '2、符合以下条件的商家可以发布竞拍商品：',
      [
        '（1）其与换换商城签订《商家入驻及经营服务协议》成为换换商城平台的入驻商家；',
        '（2）参与竞拍的商品其性质符合换换商城配套出台的《竞拍规则》的商品要求；',
        '（3）参与竞拍的商品其质量等其它因素需满足《中华人民共和国电商法》、《中华人民共和国产品质量保证法》以及其它法律法规的要求；'
      ]
    ]
  },
  {
    title: '四、竞拍服务及买家义务',
    list: [
      '1、换换商城同意向买家提供稳定的竞拍平台技术服务,使买家参与的竞拍得以顺利进行；买家同意严格按照本协议约定使用竞拍平台技术服务。',
      '2、在竞拍有效期内您确认出价的,根据换换商城设置的保证金规则,换换商城有权将您支付的保证金冻结在换换商城平台账户中;当您竞拍失败时,换换商城将向您释放保证金。',
      '3、换换商城将根据商家提供的竞拍商品的特性设置不同的保证金额度，请您仔细阅读《竞拍规则》及商家店铺、商品详情页公示的信息内容，按照约定支付保证金。',
      '4、您应当按照本协议以及所有换换商城已经发布的或将来可能发布的各类规则、操作流程参与竞拍,遵守相关出价、获得商品、成交价格、竞拍保证金止付锁定/释放/赔付等各类规定。',
      '5、如果您竞拍成功，换换商城系统则会产生一个待支付的订单，您需要在《竞拍规则》约定的时间内支付订单款项，具体的支付内容详见《竞拍规则》。',
      '6、保证金条款：',
      [
        '（1）若买家未竞拍成功，保证金会在竞拍行为结束后进行释放，退回原支付渠道，否则换换商城则应承担相应的法律责任；',
        '（2）若买家竞拍成功并支付成功的，保证金会在竞拍行为结束后进行释放，退回原支付渠道；若买家未按约定时间完成订单支付，保证金将会被扣除。'
      ]
    ]
  },
  {
    title: '五、买家竞拍不买的责任',
    list: [
      '1、除商品自身质量瑕疵以及质检报告存在问题外,所有商品均不支持7天无理由退货。故竞拍成功后,买家须按照规定完成交易,不得参与竞拍而不买。',
      '2、买家若发生以下任一情形,将视为竞拍不买。买家产生竞拍不买行为后，将承担相应的责任和后果。但买卖双方另有约定或因卖家原因导致的除外:',
      ['（1）在竞拍结束之时起的1小时内，拒绝按照成交价格支付商品货款;', '（2）在竞拍成功且付款后,买家申请退款。'],
      '3、为了维护换换商城的竞拍交易秩序,防止买家恶意参与竞拍,尽量避免并妥善处理买卖双方之间的交易纠纷,您参与竞拍时支付并冻结的保证金将为本次竞拍提供保障。如您出现竞拍不买行为,您同意换换商城有权直接扣除您的竞拍保证金；且换换商城仍有权按照换换商城平台相关规则的规定对您进行处理。'
    ]
  },
  {
    title: '六、协议终止',
    list: [
      '1、本协议在符合以下任意一项情形时终止:',
      [
        '(1)买家未竞拍成功的,本协议自保证金释放之时起终止;',
        '(2)买家竞拍成功且未出现竞拍不买情形的,本协议自交易成功之时起终止;',
        '(3)如买家在线签署的《换换商城平台服务协议》因任何原因终止,则本协议将同时终止;',
        '(4)本协议及规则调整时,您明示通知换换商城不愿接受新协议,则本协议自换换商城收到您通知之日起终止;',
        '(5)换换商城有权提前7天以书面通知以及在商城首页公示的方式终止本协议;',
        '(6)其他协议终止条件发生或实现,导致本协议终止。'
      ]
    ]
  },
  {
    title: '七、免责及有限责任',
    list: [
      '1、本协议项下的竞拍平台技术服务将按现状“现有技术可实现”的状态提供,换换商城将在现有技术的基础上尽最大努力提供相应的安全措施以保障服务安全和正常运行。但由于可能存在的计算机病毒、网络通讯故障、系统维护等方面的因素以及可能发生的不可抗力事件,换换商城在此明确声明对技术服务不作任何明示或暗示的保证,包括但不限于对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。对此买家予以理解并不应要求换换商城在以下情况下承担责任:',
      [
        '（1）系统停机维护;',
        '（2）通讯终端或电信设备出现故障不能进行数据传输的；',
        '（3）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力因素,造成系统障碍不能提供服务;',
        '（4）因黑客攻击、电信部门技术调整或故障、网站升级、第三方问题等原因而造成的服务中断或者延迟。'
      ],
      '2、在换换商城竞拍业务项下,换换商城平台卖家向您提供商品及后续相关服务（包括但不限于：商品认证材料、包装、物流运输、售后服务等）,换换商城仅向您提供技术平台及技术服务以便您与卖家之间达成商品竞拍与相关交易。',
      '3、换换商城或平台卖家就竞拍商品提供的质检报告供您参考。但是，换换商城仅承担电商平台经营者披露义务和审核责任，不对除质检报告所列信息以外的商品之真实性、合法性做任何明示或暗示的担保,及承担任何责任。您应详细查阅披露的竞拍商品质检报告并合理判断商品的实用性、性价比及可能存在的风险后再行参与竞拍。',
      '4、鉴于每个人对商品的新旧程度均有不同的评定标准,所以就物品新旧程度产生争议的,平台将不予处理、并不支持您的退货申请。',
      '5、如您在签收快递时发现商品存在与换换商城披露的此物品所涉质检服务合作方所列质检报告不一致的异常情形,请您第一时间拒签快递同时进行证据保留,以免签收或确认收货后不能进行提交有效证据证明导致财产损失。',
      '6、如因质检服务合作方质检错误导致质检报告与商品不符的且经第三方权威认证机构鉴定属实的,由质检服务方向您承担相应的赔偿责任,但最高不超过该商品对应的新品市场价格的3倍。',
      '7、买家知悉并同意,奢侈品竞拍所涉鉴定质检服务由卖家委托的质检服务方提供,由其对鉴定质检结果的真实性、合法性负全部责任。如买方收到购买的拍品后对鉴定质检结果存疑的,买家应自行垫付相应的费用(包括但不限于快递运输费、鉴定质检费等)将拍品委托其它检验机构进行二次鉴定。但您委托的其它鉴定机构应为换换商城认可的机构,否则换换商城有权拒绝接受鉴定结果并不予协调赔付事宜)。',
      '8.如经其它鉴定机构鉴定：确因质检服务方操作不当或技术失误导致鉴定错误的,由质检服务方承担二次质检的双向邮寄费用、二次质检费用并按照交易金额的3倍赔偿。'
    ]
  },
  {
    title: '八、其他约定',
    list: [
      '1、本协议适用中华人民共和国大陆地区法律。',
      '2、本协议之标题仅起到总结提示作用，相关事项的具体规定请参照条款的具体约定内容。',
      '3、因换换商城与买家就本协议的签订、履行或解释发生争议,双方应努力友好协商解决。如协商不成,换换商城和买家同意由换换商城住所地法院管辖审理双方的纠纷或争议。',
      '4、换换商城就竞拍业务发布的其它规则和协议是本协议的组成部分，与本协议有同等法律效力。'
    ]
  }
]
export default {
  name: 'auctionAgreement',
  data() {
    return {
      rules
    }
  },

  methods: {
    goBack() {
      this.$_goBack()
    }
  }
}
</script>

<style lang="scss" scoped>
.rules-contianer {
  height: 100%;
  overflow: hidden;
  display: flex;
  flex-direction: column;
}
.header {
  flex-shrink: 0;
  @include thin-border();
  /deep/ .mint-header-button {
    flex: 0.3;
  }
}
.rules-content {
  padding: 20px;
  background-color: #fff;
  flex-grow: 1;
  overflow: auto;
  color: #404040;
  h2 {
    font-size: 18px;
    text-align: center;
    font-weight: 600;
    margin-bottom: 20px;
  }
  .prog {
    font-weight: 300;
    font-size: 14px;
    line-height: 1.5;
    text-indent: 2em;
    margin-bottom: 10px;
    text-align: justify;
  }
  .title {
    margin-top: 20px;
    font-size: 15px;
  }
  ul {
    padding-left: 0.5em;
    li {
      font-weight: 300;
      font-size: 14px;
      margin-top: 10px;
      line-height: 20px;
    }
  }
}
</style>
